<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"Staging","backend":"fe81047259153bfce2e0e554d9717f122fe57b37120d09893fd00d4c76217486","plan_job_ref":"Job Staging Environment #108 at https://github.com/IrezD/cloud-s3-website-with-cicd-pipeline-v2.0/actions/runs/12973946677","plan_hash":"17c23688f36ba1273878565dc7327716b5852790893729fc218e8531bf52a277","plan_text_format":"diff","version":"1.46.1","plan_out_hash":"3abc35e49ec4342bf94aa6739a1bddfa0f722ece0bfb1881825cf9b593bdb47d","closed":true} -->
Terraform plan for __Staging__
<details>
<summary>Plan: 0 to add, 2 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-   destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.site-iam-policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "site-iam-policy" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "s3:GetObject",
+               "s3:ListBucket",
            ]
+           effect    = "Allow"
+           resources = [
+               "arn:aws:s3:::dev-portfolio-website-2.0",
+               "arn:aws:s3:::dev-portfolio-website-2.0/*",
            ]
+           sid       = "Allowing Cloudfront to access private S3 Bucket"

+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "arn:aws:cloudfront::806066816337:distribution/EOUIG3G6N7CQQ",
                ]
+               variable = "AWS:SourceArn"
            }

+           principals {
+               identifiers = [
+                   "cloudfront.amazonaws.com",
                ]
+               type        = "Service"
            }
        }
    }

  # aws_acm_certificate.site-cert will be destroyed
  # (because aws_acm_certificate.site-cert is not in configuration)
-   resource "aws_acm_certificate" "site-cert" {
-       arn                       = "arn:aws:acm:us-east-1:806066816337:certificate/3859f2b0-23aa-441b-b26e-730ad6604fe2" -> null
-       domain_name               = "dev.dennisowie.com" -> null
-       domain_validation_options = [] -> null
-       id                        = "arn:aws:acm:us-east-1:806066816337:certificate/3859f2b0-23aa-441b-b26e-730ad6604fe2" -> null
-       key_algorithm             = "RSA_2048" -> null
-       pending_renewal           = false -> null
-       renewal_eligibility       = "INELIGIBLE" -> null
-       renewal_summary           = [] -> null
-       status                    = "PENDING_VALIDATION" -> null
-       subject_alternative_names = [
-           "dev.dennisowie.com",
        ] -> null
-       tags_all                  = {
-           "Environment" = "Dev Environment"
        } -> null
-       type                      = "AMAZON_ISSUED" -> null
-       validation_emails         = [
-           "admin@dev.dennisowie.com",
-           "administrator@dev.dennisowie.com",
-           "hostmaster@dev.dennisowie.com",
-           "postmaster@dev.dennisowie.com",
-           "webmaster@dev.dennisowie.com",
        ] -> null
-       validation_method         = "EMAIL" -> null
#        (4 unchanged attributes hidden)

-       options {
-           certificate_transparency_logging_preference = "ENABLED" -> null
        }
    }

  # aws_cloudfront_distribution.s3_distribution will be updated in-place
!~  resource "aws_cloudfront_distribution" "s3_distribution" {
        id                              = "EOUIG3G6N7CQQ"
        tags                            = {}
#        (23 unchanged attributes hidden)

!~      viewer_certificate {
!~          cloudfront_default_certificate = false -> true
!~          minimum_protocol_version       = "TLSv1.2_2021" -> "TLSv1"
#            (3 unchanged attributes hidden)
        }

#        (3 unchanged blocks hidden)
    }

  # aws_s3_bucket_policy.site-bucket-policy will be updated in-place
!~  resource "aws_s3_bucket_policy" "site-bucket-policy" {
        id     = "dev-portfolio-website-2.0"
!~      policy = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = [
-                           "s3:ListBucket",
-                           "s3:GetObject",
                        ]
-                       Condition = {
-                           StringEquals = {
-                               "AWS:SourceArn" = "arn:aws:cloudfront::806066816337:distribution/EOUIG3G6N7CQQ"
                            }
                        }
-                       Effect    = "Allow"
-                       Principal = {
-                           Service = "cloudfront.amazonaws.com"
                        }
-                       Resource  = [
-                           "arn:aws:s3:::dev-portfolio-website-2.0/*",
-                           "arn:aws:s3:::dev-portfolio-website-2.0",
                        ]
-                       Sid       = "Allowing Cloudfront to access private S3 Bucket"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
#        (1 unchanged attribute hidden)
    }

Plan: 0 to add, 2 to change, 1 to destroy.
```
</details>

:white_check_mark: Plan applied in [Staging Environment #108](https://github.com/IrezD/cloud-s3-website-with-cicd-pipeline-v2.0/actions/runs/12973946677)